# DataFrames-Part-2

In [1]:
import pandas as pd
import numpy as np

In [3]:
from numpy.random import randn

In [11]:
np.random.seed(101)

In [12]:
df = pd.DataFrame(randn(5,4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [13]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Conditional Selection
* We can directly use conditional operators on DataFrame.
* The result we will get will be in the form of boolean values.

In [15]:
bool_df = df > 0

In [16]:
bool_df

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [17]:
df[bool_df]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

For `True` we are getting the original vlaues whereas for `Flase` we are getting `NaN` values.

In [18]:
# We can perform this directly.
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### We can do the same for the particular column

In [21]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

Since, `df['W']` is a `series`, If we pass this to the `DataFrame`, we will get only those rows for which the value is `True`.

In [22]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

As you can see, we did not get the row `C`.

In [25]:
# Getting all the rows, where the value of column 'Z' is less than zero.
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [26]:
resultdf = df[df['W']>0]

In [27]:
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

`resultdf` will be a `subset` of the original `DataFrame` based on the condition.   
Means we can perform operations on this sub-DataFrame also.

E.g.

In [29]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

The code in cell `26` and `29` can be done in `single` step.

In [30]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [31]:
# Acccessing the list of columns.
f[df['W']>0][['Y', 'X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [40]:
resultdf = df[df['W']>0]

In [41]:
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [42]:
resultdf.loc[['A', 'B'], ['X', 'Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077

#### <p style="color: green;">The code in cell <code>40</code> and <code>42</code> can be done in single step.</p>

In [43]:
# Accessing the sub-table.
df[df['W']>0].loc[['A', 'B'], ['X', 'Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077

### Using Multiple Conditions

We can't use python `and`operator to multiple condition. Because the `and` operator take only single instances of `boolean` value,</br>   But here we are passing it a `series` of boolean values. Due to which it is getting confused.

#### and(&)

In [44]:
# Using normal "and" operator.
df[(df['W']>0) and (df['Y']>1)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

<p style="color: green; font-size: 18px; font-style: italic;">We can use <code>&</code> symbol to do it.</p>

In [45]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

#### OR (|)

In [46]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Indexing

In [47]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### Resetting the index of the DataFrame.

In [48]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

<p style="color: green; font-size: 20px">Note:</p> 
<p>
    <ul>
        <li>We have to pass parameter <code>inplace=True</code> to reflect the changes in original DataFrame.</li>
        <li>The <code>old index</code> will become a column in your <code>DataFrame</code></li>
    </ul>
</p>

In [49]:
# Adding a column.
newCol = "AB CD EF GH IJ".split()

In [50]:
newCol

['AB', 'CD', 'EF', 'GH', 'IJ']

In [51]:
df['newCol'] = newCol

In [52]:
df

          W         X         Y         Z newCol
A  2.706850  0.628133  0.907969  0.503826     AB
B  0.651118 -0.319318 -0.848077  0.605965     CD
C -2.018168  0.740122  0.528813 -0.589001     EF
D  0.188695 -0.758872 -0.933237  0.955057     GH
E  0.190794  1.978757  2.605967  0.683509     IJ

#### Setting up a column as new Index.

In [55]:
df.set_index('newCol') # pass "inplace=True" to reflect the changes.

               W         X         Y         Z
newCol
AB      2.706850  0.628133  0.907969  0.503826
CD      0.651118 -0.319318 -0.848077  0.605965
EF     -2.018168  0.740122  0.528813 -0.589001
GH      0.188695 -0.758872 -0.933237  0.955057
IJ      0.190794  1.978757  2.605967  0.683509

<p style="color: green; font-size: 20px">Note:</p> 
<p>
    <ul>
        <li>We have to pass parameter <code>inplace=True</code> to reflect the changes in original DataFrame.</li>
        <li>Setting up a <code>new</code> index will <code>overwrite</code> the previous index and you won't be able to retain it.</li>
        
</p>

In [54]:
df

          W         X         Y         Z newCol
A  2.706850  0.628133  0.907969  0.503826     AB
B  0.651118 -0.319318 -0.848077  0.605965     CD
C -2.018168  0.740122  0.528813 -0.589001     EF
D  0.188695 -0.758872 -0.933237  0.955057     GH
E  0.190794  1.978757  2.605967  0.683509     IJ